# 인덱스 세팅 & 재설정
> DataFrame.index attribute로 직접 설정  
> DataFrame.set_index() 메서드 활용  
> DataFrame.reset_index() 메서드 활용

## DataFrame.index

In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({
    'A' : [1,2,3],
    'B' : [4,5,6],
    'C' : [7,8,9],
    'D' : [10,11,12]
})

df

   A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [5]:
df.index = [100,200,300]
df

     A  B  C   D
100  1  4  7  10
200  2  5  8  11
300  3  6  9  12

In [6]:
df.loc[200:300, 'B':'C']

     B  C
200  5  8
300  6  9

In [7]:
df.iloc[:2,:]

     A  B  C   D
100  1  4  7  10
200  2  5  8  11

## DataFrame.set_index(keys, drop = True, append = False, inplace = False)
> 특정 컬럼을 index로 설정

#### 파라미터
* keys : 컬럼명(str) or 컬럼명 리스트
* drop : 기존의 컬럼 drop
* append : 기존 인덱스 유지
* inplace : 기존 DataFrame을 변경

In [34]:
df = pd.DataFrame({
    'A' : [1,2,3],
    'B' : [4,5,6],
    'C' : [7,8,9],
    'D' : [10,11,12]
})

df

   A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [37]:
df.set_index('B')

   A  C   D
B
4  1  7  10
5  2  8  11
6  3  9  12

In [38]:
df.set_index(['B','C'])

     A   D
B C
4 7  1  10
5 8  2  11
6 9  3  12

In [39]:
df.set_index('B', drop = False)

   A  B  C   D
B
4  1  4  7  10
5  2  5  8  11
6  3  6  9  12

## DataFrame.reset_index(drop = False, inplace = False)
> 인덱스를 단순 정수 인덱스로 재설정

#### 파라미터
* drop : 기존의 인덱스를 컬럼으로 설정
* inplace : 기존 DataFrame을 변경

In [43]:
df = pd.DataFrame({
    'A' : [1,2,3],
    'B' : [4,5,6],
    'C' : [700,800,900],
    'D' : [10,11,12]
})

df.set_index('C', inplace = True)
df

     A  B   D
C
700  1  4  10
800  2  5  11
900  3  6  12

In [41]:
df.reset_index()

   C  A  B   D
0  7  1  4  10
1  8  2  5  11
2  9  3  6  12

In [42]:
df.reset_index(drop = True)

   A  B   D
0  1  4  10
1  2  5  11
2  3  6  12